tutorials/CFD/01bisPODCompare/0/fullStressFunction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "././0";
    object      fullStressFunction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
11644
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
40
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
40
(
(6.2018756e-34 2.4010014e-23 0)
(-6.2018756e-34 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            symmetryPlane;
    }
    sides
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
200
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    cylinder1
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
318
(
(6.1534147 0.7640055 2.3244862e-16)
(-0.24378213 15.364793 -2.7230576e-16)
(-0.24242363 -15.36188 8.2396259e-18)
(6.1523317 -0.76384355 -6.0426142e-19)
(192.8844 29.683759 1.301682e-16)
(-21.36212 -20.947863 2.6120487e-16)
(5.7857777 -1.1757535 -2.1377761e-16)
(-21.362106 20.947888 1.5303289e-17)
...
)
;
    }
}

