tutorials/CFD/01bisPODCompare/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

fields
(
U_pod
p_pod
);

U_pod
{
// Specify the field name
field_name U;
// Specify the number of modes you want to extract
nmodes 2;
// Specify the type of field (if vector or scalar)
field_type vector;
}

p_pod
{
// Specify the field name
field_name p;
// Specify the number of modes you want to extract
nmodes 2;
// Specify the type of field (if vector or scalar)
field_type scalar;
}

// Root path where OpenFOAM simulation outputs are
//rootpath "/";
rootpath ".";

// Path (from rootPath) where OpenFOAM simulation outputs are
//casename "home/valentinresseguier/HDD/Guillaume_Le_Pape_data/sillageRe300/";
casename "./";
//casename "../sillageLESRe100/";

//// Path where OpenFOAM simulation outputs are
//pathData "../sillageRe300/";

// Set Time from which you want to start taking the Snapshots
//InitialTime 100.0;
InitialTime 0.0;

// Set Time when you want to stop taking the Snapshots
FinalTime 5.0;
//FinalTime 103.0;
//FinalTime 600.3;

// Set Time when you want to stop taking the Snapshots
//FinalTimeSimulation 201.0;
//FinalTimeSimulation 250.0;
//FinalTimeSimulation 105.0;
//FinalTimeSimulation 600.5;

// Eventually you could set just InitalTime and Number of Snapshots you want
// Nsnapshots 40;

// number of blocks to compute cov matrix
nBlocks 2;

// if 1, the snapshots are centered before POD (snapshots = snapshots - meanField)
centeredOrNot 0;

// if 1, the interpolated field snapshots are centered before POD (snapshots = snapshots - meanField)
interpFieldCenteredOrNot 0;

// 1 if you want to export reduce matrices on specific format
exportPython 0;
exportMatlab 0;
exportTxt 1;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// name of eigensolver : eigen or spectra
// EigenSolver eigen;

// name of results folder : ITHACAoutput by default
// resultsFolder ITHACAoutput;

// Number of stochastic POD simulations
// nbSimulations 100;
nParticules 2;
//nParticules 100;

reducingNoisesMatrix 0;

// Time step decreasing factor for ROM time integration
// N_resolve 1;
nSimu 100;

nMagicPoints 3;

//DEIMInterpolatedField "nut";
stochasOrNot 0;

useStratonovich 0;

useSOTA "None";

pressureResolutionKind "ReducedOrder";


