tutorials/CFD/01bisPODCompare/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication pimpleFoam
runApplication compare_POD
